In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset = {
        "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
        "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
        "Maaş":[3000,3500,2500,4500,4000,2000]
        }

In [3]:
df=pd.DataFrame(dataset)

In [4]:
DepGroup=df.groupby("Departman")

In [5]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [6]:
DepGroup.sum().loc["Bilişim"]

Maaş    7000
Name: Bilişim, dtype: int64

In [7]:
int(DepGroup.sum().loc["Bilişim"])

7000

In [8]:
DepGroup.count()

                  Çalışan  Maaş
Departman
Bilişim                 2     2
Üretim                  2     2
İnsan Kaynakları        2     2

In [9]:
DepGroup.max()

                  Çalışan  Maaş
Departman
Bilişim           Mustafa  4000
Üretim             Zeynep  4500
İnsan Kaynakları     Jale  3500

In [10]:
DepGroup.max().loc["Bilişim"]

Çalışan    Mustafa
Maaş          4000
Name: Bilişim, dtype: object

In [11]:
DepGroup.max().loc["Bilişim"].loc["Maaş"]

4000

In [12]:
DepGroup.mean()

                  Maaş
Departman
Bilişim           3500
Üretim            3500
İnsan Kaynakları  2750